{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting 7 implemented features including hero section, product sections, reviews, newsletter, and footer with associated files and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend source files describing components, pages, contexts, and utilities for the e-commerce application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors, borders, and component styling tokens.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the React application.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with 8 routes and wrapping the application with AuthProvider and CartProvider contexts.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product image, details, quantity controls with plus/minus buttons, and remove functionality.",
  "frontend/src/components/CustomerReviews.tsx": "Customer reviews section displaying 3 hardcoded 5-star reviews with author names and comments in a responsive grid.",
  "frontend/src/components/FeaturedProducts.tsx": "Featured products section showing the first 4 products from constants in a responsive grid with heading and description.",
  "frontend/src/components/FiltersSidebar.tsx": "Collapsible filters sidebar with category checkboxes, price range slider, and rating filters, supporting both desktop and mobile sheet layouts.",
  "frontend/src/components/Footer.tsx": "Footer component with multi-column navigation links (Products, Company, Support, Legal), social media icons, copyright notice, and a caffeine.ai attribution link.",
  "frontend/src/components/HeroSection.tsx": "Hero section with animated text content, CTA buttons (Shop Now, Learn More), and a large product image with fade-in animations on mount.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with Navbar, main content outlet, and Footer in a flex column structure.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation bar with logo, desktop/mobile navigation links, user account icon, shopping cart with item count badge, and mobile sheet menu.",
  "frontend/src/components/NewsletterSignup.tsx": "Newsletter subscription section with email input form and success message that auto-clears after 3 seconds.",
  "frontend/src/components/OrderHistory.tsx": "Displays mock order history with order details, status badges (processing/shipped/delivered), item thumbnails, and total prices.",
  "frontend/src/components/ProductCard.tsx": "Simple product card component with image, name, and price that navigates to product detail page on click.",
  "frontend/src/components/ProductDetailsTabs.tsx": "Tabbed interface for product details showing description, specifications table, and mock customer reviews with ratings.",
  "frontend/src/components/ProductGallery.tsx": "Product image gallery with large main image and thumbnail grid for selecting different product views.",
  "frontend/src/components/ProductGridCard.tsx": "Enhanced product card with hover effects, wishlist heart button, add-to-cart button, and navigation to product detail page.",
  "frontend/src/components/ProductInfoPanel.tsx": "Displays product details with interactive controls for size, color, and quantity selection, plus 'Add to Cart' and 'Buy Now' buttons that navigate to the cart page.",
  "frontend/src/components/ProductShowcase.tsx": "Renders two featured products in alternating left-right layout with scroll-triggered fade-in animations using the useScrollAnimation hook.",
  "frontend/src/components/ProfileEdit.tsx": "Provides a form for editing user profile information (name, email, phone) and displays a placeholder section for managing saved addresses.",
  "frontend/src/components/SortDropdown.tsx": "A dropdown select component for sorting products by featured, price (low/high), or rating.",
  "frontend/src/components/WhyChooseUs.tsx": "Displays three benefit cards (Fast Shipping, Premium Quality, 24/7 Support) with icons and descriptions in a grid layout.",
  "frontend/src/components/WishlistView.tsx": "Shows a grid of wishlist products with remove buttons and 'Add to Cart' functionality for each item.",
  "frontend/src/context/AuthContext.tsx": "Provides authentication context with mock login/register/logout functions and persists user data to localStorage.",
  "frontend/src/context/CartContext.tsx": "Manages shopping cart state with add, remove, update, and clear operations, persisting cart items to localStorage and calculating totals.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an ICP backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication integration with AuthClient, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook using IntersectionObserver to detect when an element becomes visible in the viewport for triggering scroll animations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (colors, radius) and utility classes for touch targets and smooth transitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AccountDashboard.tsx": "User account dashboard with tabbed navigation for profile, orders, wishlist, and settings, plus logout functionality.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items, order summary with shipping costs, and checkout navigation.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout form page with shipping address input, payment method selection, and order summary display.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page composing hero section, featured products, benefits, showcase, reviews, and newsletter signup components.",
  "frontend/src/pages/LoginPage.tsx": "Login page with email/password form, remember me checkbox, and link to registration page.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page with image gallery, product info panel, size/color/quantity selection, and sticky mobile add-to-cart bar.",
  "frontend/src/pages/ProductListingPage.tsx": "Product listing page with filterable sidebar (category, price, rating) and sortable product grid display.",
  "frontend/src/pages/RegisterPage.tsx": "User registration page component with form fields for name, email, password, and password confirmation, using AuthContext for registration and navigation to account page on success.",
  "frontend/src/types/index.ts": "TypeScript type definitions for core data models including Product, CartItem, User, Address, Order, and Review interfaces used throughout the application.",
  "frontend/src/utils/constants.ts": "Constants file defining product catalog data (5 premium tech products with details), category list, and shipping cost configuration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors using OKLCH color space, typography, spacing, shadows, border radius, and animations for accordion components.",
  "project_state.json": "Project metadata defining an Apple-inspired minimal e-commerce site with architectural notes, feature list, image requirements, and design principles emphasizing clean aesthetics and responsive layouts."
}